# Коэффициенты из стандарта JPEG2000
COEFFICIENT_PACKAGE = {'alpha': -1.586134342,
                       'beta': -0.05298011854,
                       'gamma': 0.8829110762,
                       'delta': 0.4435068522,
                       'k1': 0.81289306611596146,
                       'k2': 0.61508705245700002}

COEFFICIENT_UN_PACKAGE = {'alpha': 1.586134342,
                          'beta': 0.05298011854,
                          'gamma': -0.8829110762,
                          'delta': -0.4435068522,
                          'k1': 1.230174104914,
                          'k2': 1.6257861322319229}
# Константы для встраивания
BLOCK_HEIGHT = 4
BLOCK_WIDTH = 1
QUANT_SIZE = 60
